# ---- Moksha chess ----
# 解脱棋

library(shiny) 
#library(DT)
#library(shinythemes)

ReincarnationPlace <<- c('法身层面','报身层面(五方佛士)','色究竟天','金刚萨缍大乐净士',
                         '宝生如来庄严净土(宝生部所在层面)','毗如遮那光明遍照净土(佛部所在层面)',
                         '不空成就无比事业净士(羯摩部所在层面)','化身层面',
                         '不动如来大乐净土(金刚部所在层面)','观世音布达拉净土',
                         '天界空行净土','莲花生莲花光净土','阿弥陀佛极乐净土(莲花部所在层面)',
                         '乌金空行净土','绿度母净土','金刚手阿拉瓦提净土','香巴拉净土',
                         '南却空嘉(天空女王)净土','乐音塔瓦','云托塔瓦','护持塔瓦',
                         '广遍塔瓦','棍棒塔瓦','长喜塔瓦','遍入塔瓦','声音塔瓦',
                         '五色风塔瓦','珍宝塔瓦','汇聚塔瓦','白圣塔瓦','星际塔瓦',
                         '基督教天堂','伊斯兰教天堂','犹太教天堂',
                         '不动金刚层面(金刚乘的证悟层面之一)',
                         '莲花层面(金刚乘的证悟层面之一)','遍光层面(金刚乘的证悟层面之一)',
                         '元成持明(四个玛哈瑜伽证悟层面之一)','大手印持明',
                         '长寿持明(四个玛哈瑜伽证悟层面之一)',
                         '异熟持明(四个玛哈瑜伽证悟层面之一)',
                         '十地菩萨(大乘证悟的十个层面之一)',
                         '九地菩萨(大乘证悟的十个层面之一)',
                         '八地菩萨(大乘证悟的十个层面之一)',
                         '七地菩萨(大乘证悟的十个层面之一)',
                         '六地菩萨(大乘证悟的十个层面之一)',
                         
                         '五地菩萨(大乘证悟的十个层面之一)',
                         '四地菩萨(大乘证悟的十个层面之一)',
                         '三地菩萨(大乘证悟的十个层面之一)',
                         '二地菩萨(大乘证悟的十个层面之一)',
                         '一地菩萨(大乘证悟的十个层面之一)',
                         '无学道菩萨(大乘五道之一)','修道位菩萨',
                         '见道位菩萨(大乘五道之一)','加行道菩萨(大乘五道之一)',
                         '资粮道菩萨(大乘五道之一)','缘觉佛成就(小乘的辟支佛)',
                         '声闻阿罗汉成就(小乘声闻四果)','声闻不还果(阿那含，小乘声闻三果)',
                         '声闻一-还果(斯陀含，小乘声闻二果)','声闻入流果(须陀洹，小乘声闻一果)',
                         '声闻寂止道(小乘)','阿底瑜伽自解脱道','阿努瑜伽转化道',
                         '玛哈瑜伽转化道','金刚乘直捷道','佛法之道','苯教之道',
                         '印度教之道','基督教之道','伊斯兰教之道','犹太教之道',
                         '道教之道','耆那教之道','神道教之道','萨满教','无色界天',
                         '色界天','欲界天','半神人(阿修罗)','人类','中阴(中间状态)',
                         '基督徒中阴','伊斯兰教徒中阴','阎魔(死主)层面','大力玛莫',
                         '楼陀罗','濡湿-赞神','扎提-甲贡','夏萨-夜叉','龙族','年神玛桑',
                         '爪拉沃玛(武士鬼神)','乾达婆(寻香，天人乐师)','孔班达',
                         '克拉夫雅达(食肉鬼神)','兰卡罗刹','布塔鬼','毗舍遮鬼',
                         '传播疾病的乌帕扎瓦魔','维格纳魔(障碍者)','畜生道','饿鬼道',
                         '地狱道','金刚地狱','基督教地狱','伊斯兰教地狱','多欲黑地狱')

Table_places <<- data.frame(
    x1 = 1:108,
    ReincarnationPlace,
    stringsAsFactors = F
)

Number_touzi <<- c(11,22,33,44,55,66,
                 12,13,14,15,16,
                 23,24,25,26,
                 34,35,36,
                 45,46,
                 56)

IndexTables <<- list(
    x2 = c(1,1,1,1,1,1,
           2,2,
           3,3,
           4,4,
           5,5,
           6,6,
           2,2,2,2,2),
    x3 = c(
        1,1,1,1,1,1,
        3,3,3,
        4,4,4,
        5,5,5,
        6,6,6,
        7,7,7
    ),
    x4 = c(1,1,1,1,1,1,
           3,3,3,4,4,4,
           5,5,5,
           6,6,6,
           7,7,7),
    x5 = c(1,1,1,1,1,1,
           3,3,3,
           4,4,4,
           5,5,5,
           6,6,6,
           7,7,7),
    x6 = c(
        1,1,1,1,1,1,
        3,3,3,4,4,4,
        5,5,5,
        6,6,6,
        7,7,7
    ),
    x7 = c(
        1,1,1,1,1,1,
        3,3,3,
        4,4,4,
        5,5,5,
        6,6,6,
        7,7,7
    ),
    x8 = c(
        1,2,2,2,2,
        1,9,9,9,9,9,
        10,10,10,10,
        13,13,13,13,13,
        81
    ),
    x9 = c(
        rep(8,6), rep(9,5),rep(10,4), rep(13,5), 81
    ),
    x10 = c(
        rep(8,6), rep(9,5),
        rep(10,4), rep(13,5), 81
    ),
    x11 = c(
        2,rep(8,4),
        2,3,3,3, rep(11,3),
        rep(14,3), 
        23,24,25,26,31,
        81
    ),
    x12 = c(
        2,rep(8, 4), 
        2, rep(3,3),
        rep(12,3), 13,13,14,14,
        19,20,21,22,81
    ),
    x13 = c(
        2, rep(8,4),
        2, rep(9,3), rep(10,4), rep(13,4), rep(15,3), 81
    ),
    x14 = c(
        2, rep(8,4), 2, rep(3,3),
        12,12,13,13,14,14,
        16,19,20,21,22,81
    ),
    x15 = c(
        2, rep(8, 4), 2, 9,9,9,
        rep(10,4), rep(13,4), rep(15,3), 81
    ),
    x16 = c(
        2,rep(8,4), 2 ,
        rep(3,3), 
        rep(12,3),rep(13,2),
        rep(14,3),
        rep(16,3),
        81
    ),
    x17 = c(
       2, rep(8,4),
       2, rep(3,3),
       rep(12,3), rep(13,3), rep(14,3),
       16,16,81
    ),
    x18 = c(
        63, rep(68,4),
        63, 77,77,
        rep(78,3),
        rep(79,3),
        rep(18, 3),
        92,93,81,76
    ),
    x19 = c(
        35,36,37,40,39,
        38,11,11,12,12,
        14,14,16,17,
        23,19,20,21,22,
        81,82
    ),
    x20 = c(
        35:37, 40,39,
        38,11,11,12,12,
        14,17,13,28,25,
        19,21,20,80,78,88
    ),
    x21 = c(
        35:37,40,39,
        38,11,12,12,14,
        17,19,30,20,27,
        24,29,21,79,81,82
    ),
    x22 = c(
        35:37,40,39,
        38,11,12,12,14,
        17,10,16,15,19,
        21,20,22,78,81,103
    ),
    x23 = c(
        36,37,41,40,39,
        38,12,12,14,17,
        19,20,27,24,25,
        22,31,23,79,78,104
    ),
    x24 = c(
        35:37,40,39,
        38,12,12,14,
        17,16,15,21,26,
        23,27,25,24,79,81,82
    ),
    x25 = c(
        36,37,41,40,39,
        38,12,12,14,17,
        13,27,28,24,22,
        21,25,78,81,102,82
    ),
    x26 = c(
        36,37,41,40,39,
        38,12,12,14,17,
        21,22,23,24,25,
        29,26,79,78,80,102
        
    ),
    x27 = c(
        37,41,41,40,39,
        38,12,12,14,17,
        19,20,23,31,29,
        28,27,77,78,81,99
    ),
    x28 = c(
        37,41,41,40,39,
        38,12,12,14,17,
        21,25,31,27,30,
        29,28,91,79,81,82
    ),
    x29 = c(
        37,41,41,40,39,
        38,12,12,14,17,
        19,22,23,26,30,
        28,29,78,81,86,91
    ),
    x30 = c(
      38,41,41,40,39,
      38,12,12,14,17,
      19,24,27,28,29,
      30,31,78,79,81,82  
    ),
    x31 = c(
        38,41,41,40,39,
        38,12,12,14,17,
        19,24,27,28,29,
        30,31,78,79,81,82
    ),
    x32 = c(
        rep(32,18), 79,81,80
    ),
    x33 = c(
        rep(33, 19), 81, 108
    ),
    x34 = c(
        rep(34,17),
        78,79,81,108
    ),
    x35 = c(
        rep(8,6),
        9,11,10,12,
        13,13,15,14,16,
        31,21,35,79,78,81
    ),
    x36 = c(
        rep(36,6), 
        9,13,10,14,11,
        12,16,15,28,19,
        36,36,78,79,81
    ),
    x37 = c(
        rep(36,6),
        9,11,10,12,13,
        14,15,16,17,22,
        28,37,64,80,81
    ),
    x38 = c(
        8, rep(37,4),
        2,9,9,10,12,
        11,13,14,16,15,
        24,20,38,79,81,82
    ),
    x39 = c(
        8,rep(38,4),
        37, 9,14,10,12,
        11,13,15,16,25,
        29,20,39,78,81,87
    ),
    x40 = c(
        38,rep(39,4),
        37,9,12,10,14,
        11,13,16,15,28,
        27,14,40,81,97,104
    ),
    x41 = c(
        39,rep(40,4),
        38,9,12,10,13,
        11,14,15,17,16,
        41,41,79,81,85,102
    ),
    x42 = c(
        8,rep(37,4),
        8,9,9,10,10,
        13,13,16,15,12,
        42,42,79,78,77,81
    ),
    x43 = c(
        rep(42,6),
        9,9,10,10,
        13,13,16,15,43,
        43,78,79,81,90,91
    ),
    x44 = c(
        rep(43,6),
        9,9,10,10,13,
        13,16,15,44,44,
        79,78,81,80,98
    ),
    x45 = c(
        rep(44,6),
        9,9,10,10,13,
        13,16,15,45,45,
        45,77,78,81,103
    ),
    x46 = c(
        rep(45,6),
        9,9,10,10,13,
        13,16,15,46,46,
        46,79,78,81,95
    ),
    x47 = c(
        rep(46,6),
        9,9,10,10,13,
        13,16,15,47,47,
        47,78,79,81,102
    ),
    x48 = c(
        rep(47,6),
        9,9,10,13,16,
        15,48,48,48,48,
        77,78,79,81,103
    ),
    x49 = c(
        rep(48,6),
        9,9,10,13,16,
        15,
        rep(49,4),
        78,81,80,96,104
    ),
    x50 = c(
        rep(49,6),
        9,9,10,13,16,
        15,
        rep(50,4),
        78,79,81,94,102
    ),
    x51 = c(
        rep(50,6),
        9,9,10,13,16,15,
        rep(51,5),
        81,80,98,88
    ),
    x52 = c(
        rep(51,6),
        9,13,10,16,12,
        rep(52,5),
        77,78,79,81,102
    ),
    x53 = c(
        rep(52,6),
        9,10,13,16,12,
        rep(53,5),
        78,81,80,90,103
    ),
    x54 = c(
        rep(53,6),
        9,10,13,12,14,
        rep(54,5),
        77,78,79,81,104
    ),
    x55 = c(
        rep(54, 6),
        9,10,13,16,
        rep(55,5),
        77,78,79,80,81,82
    ),
    x56 = c(
        rep(55,6),
        9,10,12,13,15,
        16,66,65,56,56,
        78,79,80,81,82
    ),
    x57 = c(
        rep(54,6),
        9,rep(57,11),
        77,78,81
    ),
    x58 = c(
        54, rep(57,4),54,
        rep(58,12),
        77,78,79
    ),
    x59 = c(
        rep(58,6),
        rep(59,12),
        77,78,81
    ),
    x60 = c(
        rep(59, 6),
        rep(60,8),
        rep(62,3),
        77,78,79,81
    ),
    x61 = c(
        rep(60,6),
        rep(61,9),
        rep(62,3),
        77,78,81
    ),
    x62 = c(
        56, rep(62,4), 56,
        rep(62, 15)
    ),
    x63 = c(
        37,rep(38,4),
        37,12,13,14,19,
        24,26,27,63,63,
        78,79,80,81,82,105
    ),
    x64 = c(
        38, rep(40,4),
        38,12,13,14,20,
        24,25,28,64,64,
        78,79,80,81,82,105
    ),
    x65 = c(
        3, rep(41,4),
        39,12,13,14,19,
        23,26,29,65,65,
        78,79,80,81,82,105
    ),
    x66 = c(
        40,63,64,65,56,
        40,11,12,14,15,
        16,17,66,66,77,
        78,79,80,81,82,105
    ),
    x67 = c(
        63,65,66,56,62,
        64,10,12,13,14,
        15,77,78,79,80,
        81,82,102,103,104,108
    ),
    x68 = c(
        63,rep(18,4),
        66,17,68,77,78,
        79,80,81,82,93,
        91,92,102,103,104,105
    ),
    x69 = c(
        66,68,74,71,70,
        67,69,69,69,77,
        78,78,79,79,80,
        81,82,102,103,104,108
    ),
    x70 = c(
        rep(32,6),
        rep(70,4),
        79,78,83,83,
        rep(106,7)
    ),
    x71 = c(
        rep(33,6),
        rep(71,7),
        84,rep(107,6),80
    ),
    x72 = c(
        rep(34,6),
        rep(72,7),
        78,79,79,80,80,
        81,82,108
    ),
    x73 = c(
        rep(18,6),
        rep(73,5),
        rep(78,3),rep(79,3),
        rep(80,3),108
    ),
    x74 = c(
        rep(74,6),
        77,77, rep(78,3), rep(79,3),
        80,80,81,94,99,102,108
    ),
    x75 = c(
        rep(18,6),
        77,77,rep(78,3),
        rep(79,3),
        rep(80,4),
        96,98,108
    ),
    x76 = c(
        rep(18,6),
        rep(78,2), rep(79,3),
        96,97,99,100,101,
        80,81,82,102,108
    ),
    x77 = c(
        56,67,67,68,69,62,
        rep(77,5),
        rep(78, 2), rep(79,2),
        80,81,82,102,103,104
    ),
    x78 = c(
        56,67,67,68,69,
        62,77,77,
        rep(78,5),
        79,79,80,81,82,
        102,103,104
    ),
    x79 = c(
        63,67,69,70,74,
        66,77,77,78,78,
        rep(79,5),
        80,81,82,102,103,104
    ),
    x80 = c(
        67,73,72,71,69,
        68,78,79,80,81,
        82,85,86,87,88,
        90,92,97,102,103,104
    ),
    x81 = c(
      63,56,62,68,66,
      64,69,70,71,
      72,76,77,78,79,
      80,81,81,82,102,103,104
    ),
    x82 = c(
      2,56,67,68,66,
      63,77,78,79,80,
      81,82,88,91,94,
      96,97,98,102,103,104
    ),
    x83 = c(
      32,rep(70,4),
      32, rep(83,12),
      rep(108,3)
    ),
    x84 = c(
      33, rep(71,4),
      33,rep(84, 14),
      108
    ),
    x85 = c(
      66,69,73,75,76,
      66,78,79, rep(80,3),
      rep(85,4),
      90,97,98,102,103,104
    ),
    x86 = c(
      66,68,69,73,76,
      66,79,80,rep(86,3),
      91,92,94,95,96,
      97,98,102,103,104
    ),
    x87 = c(
      66,69,70,71,76,
      68,79,rep(80,3),
      81, rep(87,4),
      88,91,97,102,103,104
    ),
    x88 = c(
      66,68,69,75,76,
      67,79,80,80,81,
      87,rep(88,4),
      91,92,97,102,103,104
    ),
    x89 = c(
      67,68,71,75,76,
      69,80,80,rep(89,3),
      98, rep(99,3),
      100,100,101,102,103,104
    ),
    x90 = c(
      66,68,69,73,76,
      66,79,80,81,85,
      86,87,rep(90,3),
      92,97,98,102,103,104
    ),
    x91 = c(
      65,56,68,69,73,
      66,78,79,80,81,88,
      rep(91,4),92,
      95,97,102,103,104
    ),
    x92 = c(
      66:69,76,
      18,78,79,80,81,
      88,90,rep(92,3),
      93,93,98,102,103,104
    ),
    x93 = c(
      rep(18,6),
      79,80,rep(92,3),
      rep(93,4),
      96,96,102,102,103,104
    ),
    x94 = c(
      67,68,69,73,74,
      67,82,rep(94,4),
      98,98,99,99,102,
      102,103,103,104,104
    ),
    x95 = c(
      rep(67,6),
      78:82,
      86,91,91,95,95,
      95,98,102,103,104
    ),
    x96 = c(
      67:69,73,75,
      67,86,93,rep(96,3),
      97,98,99,99,102,
      102,103,103,104,104
    ),
    x97 = c(
      65,rep(66,4),65,
      86,87,90,96,96,
      rep(97,3),98,102,
      102,103,103,104,104
    ),
    x98 = c(
      67,68,69,76,66,
      67,87,90,94,96,
      97,rep(98,3),102,
      102,103,103,104,104,104
    ),
    x99 = c(
      67:69,76,66,
      67,89,89,94,94,
      rep(96,2),rep(99,3),
      102,102,103,103,104,104
    ),
    x100 = c(
      67:69,76,76,
      67,94,96,98,98,
      rep(100,3),101,89,
      102,102,103,103,104,104
    ),
    x101 = c(
      67,68,69,73,76,
      67,94,96,99,100,
      89,rep(101,4),
      102,102,103,103,104,104
    ),
    x102 = c(
      67:69,74,76,
      108,81,82,85,86,
      88,90,91,93,96,
      rep(102,3),
      103,104,104
    ),
    x103 = c(
      rep(67,6),
      79:82,88,94,
      94,96,98,
      rep(102,3),
      103,103,104
    ),
    x104 = c(
      67:69,74,76,
      67,79:82,
      86,91,102,103,
      85,
      rep(104,5),108
    ),
    x105 = c(
      67,82,102,103,104,
      81,
      rep(105,15)
    ),
    x106 = c(
      79,rep(106,4),
      70,
      rep(106,13),
      79,108
    ),
    x107 = c(
      71,rep(107,4),
      71,rep(107,14),80
    ),
    x108 = c(
      63,66,56,62,68,
      65,69,70,71,72,
      73,74,75,76,79,
      80,81,82,102,103,104
    )
)
x71 = x72 = x73 = x74 = x75 = x76 = x77 = x78 = 
  x79 = x80 = x81 = x82 = x83 = x84 = x85 = x86 = x87 = x88 = 
  x89 = x90 = x91 = x92 = x93 = x94 = x95 = x96 = x97 = x98 = 
  x99 = x100 = x101 = x102 = x103 = x104 = x105 = x106 = x107 = x108 = c(rep('',21))
LabelTables <<- list(
  x2 = c(rep('',21) ),
  x3 = c(rep('',21) ),
  x4 = c(rep('',21) ),
  x5 = c(rep('',21) ),
  x6 = c(rep('',21) ),
  x7 = c(rep('',21) ),
  x8 = c(rep('',20), "&" ),
  x9 = c(rep('',20), "&" ),
  x10 = c(rep('',20), "&" ),
  x11 = c(rep('',20), "&" ),
  x12 = c(rep('',20), "&" ),
  x13 = c(rep('',20), "&" ),
  x14 = c(rep('',20), "&" ),
  x15 = c(rep('',20), "&" ),
  x16 = c(rep('',20), "&" ),
  x17 = c(rep('',20), "&" ),
  x18 = c(rep('',17), rep("&",4)),
  x19 = c(rep('',19), rep("&",2)),
  x20 = c(rep('',18), rep("&",3)),
  x21 = c(rep('',18), rep("&",3)),
  x22 = c(rep('',18), rep("&",3)),
  x23 = c(rep('',18), rep("&",3)),
  x24 = c(rep('',18), rep("&",3)),
  x25 = c(rep('',21) ),
  x26 = c(rep('',17), rep("&",4)),
  x27 = c(rep('',17), rep("&",4)),
  x28 = c(rep('',17), rep("&",4)),
  x29 = c(rep('',17), rep("&",4)),
  x30 = c(rep('',17), rep("&",4)),
  x31 = c(rep('',21) ),
  x32 = c(rep('',18), rep("+",3)),
  x33 = c(rep('',19), rep("+",2)),
  x34 = c(rep('',17), rep("+",4)),   
  x35 = c(rep('',18), rep("&",3)),
  x36 = c(rep('',18), rep("&",3)),
  x37 = c(rep('',18), rep("&",3)),
  x38 = c(rep('',18), rep("&",3)),
  x39 = c(rep('',18), rep("&",3)),
  x40 = c(rep('',18), rep("&",3)),
  x41 = c(rep('',17), rep("&",4)),
  x42 = c(
    rep('',14), '*',
    rep('',6)
  ),
  x43 = c(rep('',17), rep("&",4)),
  x44 = c(rep('',16), rep("&",5)),
  x45 = c(rep('',21) ),
  x46 = c(rep('',17), rep("&",4)),
  x47 = c(rep('',17), rep("&",4)),
  x48 = c(rep('',21) ),
  x49 = c(rep('',16), rep("&",5)),
  x50 = c(rep('',16), rep("&",5)),
  x51 = c(rep('',17), rep("&",4)),
  x52 = c(rep('',6), rep('*',5),
          rep('',5),
          rep("&",5)),
  x53 = c(rep('',6), rep('*',5),
          rep('',5),
          rep("&",5)),
  x54 = c(rep('',6), rep('*',5),
          rep('',5),
          rep("&",5)),
  x55 = c(rep('',6), rep('*',4),
          rep('',8),
          rep("&",3)),
  x56 = c(rep('',6), rep('*',6),
          rep('',9)
          ),
  x57 = c(rep('',18), rep("&",3)),
  x58 = c(rep('',18), rep("&",3)),
  x59 = c(rep('',18), rep("&",3)),
  x60 = c(rep('',21) ),
  x61 = c(rep('',21) ),
  x62 = c(rep('',21) ),
  x63 = c(rep('',6), rep('*',3),
          rep('',12)
  ),
  x64 = c(rep('',6), rep('*',3),
          rep('',12)
  ),
  x65 = c(rep('',6), rep('*',6),
          rep('',9)
  ),
  x66 = c(rep('',6), rep('*',6),
          rep('',9)
  ),
  x67 = c(rep('',6), rep('*',5),
          rep('',10)
  ),
  x68 = c(rep('',6), rep('*',1),
          rep('',14)),
  x69 = c(rep('',21) ),
  x70 = c(rep('',21) ),
  x71, x72 , x73 , x74 , x75 , x76 , x77 , x78 , 
    x79 , x80 , x81 , x82 , x83 , x84 , x85 , x86 , x87 , x88 , 
    x89 , x90 , x91 , x92 , x93 , x94 , x95 , x96 , x97 , x98 , 
    x99 , x100 , x101 , x102 , x103 , x104 , x105 , x106 , x107 , x108
)

# for (i in 1:n) {
#   mm = length(LabelTables[[i]])
#   print(paste0(i,",",mm))
# }

ui <- tagList(
    #shinythemes::themeSelector(),
    navbarPage(
        "解脱棋索引系统",
        tabPanel("前言", 
                 sidebarLayout(
                     sidebarPanel(
                         h2("解脱棋索引系统", align = 'center'),
                         h3("The Indexing System for Moksha Chess", align = 'center'),
                         tags$hr(),
                         h5('Author：Xiaoxiang Guan (管晓祥)'),
                         #h5('地址：山西省忻州市台怀镇护银沟村'),
                         h5('Contact：xxguan_hhu@163.com'),
                     ),
                     mainPanel(
                         h2('前言', align = 'center'),
                         h4('

解脱游戏的文字是1995年当我在泰国Hua Hin度假时写成的。

当我回到火山营时，我把它输入到电脑里，其中的藏文书法由此可以打印。之后我给我的弟子和翻译吉姆，外奥比(JimValby)一份拷贝，他第一个将此文译成英文。

      1998年，在俄国的一次阿底大圆满禅修中，我发现有必要在此文中添加十三个塔瓦(译注:指类似太阳系的含有大圆满教法

的星系)以及八部鬼神(天龙八部)的层面。于是总共108个4不同层面由此被纳入此游戏中。 

之后我将此文给了我的弟子Lauri Denyer,同时指示了如何绘制此游戏中的坛城，请她进行相应的绘画。Lauri 为此贡献了极大的努力，且成绩斐然。她的工作对于此游戏的实现非常重要，为此我很感谢她。

以下108个层面的描述也是由Lauri Denyer 写成。

      '),
                         h4('南开诺布', align = 'right')
                         
                     )
                 )
        ),
        tabPanel("108个层面的描述",
                 h5(" 108个层面的描述" , align = 'center'),
                 tags$hr(),
                 h5(" 1. 法身层面:彩虹围绕的蓝色光球" ),
                 h5(" 2. 报身层面(五方佛士):彩虹围绕的五个不同颜色的光球" ),
                 h5(" 3. 色究竟天:噶那维哈净士:位于莲花中的座山的山顶宫殿。" ),
                 h5(" 4. 金刚萨缍大乐净士:金刚杵和金刚铃，金刚萨锤之象征。" ),
                 h5(" 5. 宝生如来庄严净土(宝生部所在层面):五色彩虹围绕的黄色光球内一个珠宝。" ),
                 h5(" 6. 毗如遮那光明遍照净土(佛部所在层面):五色彩虹围绕的白色光球内的一个法轮。" ),
                 h5(" 7. 不空成就无比事业净士(羯摩部所在层面):五色彩虹围绕的绿色光球内的一个十字金刚杵。" ),
                 h5(" 8. 化身层面:五色彩虹围绕的光球内人类的佛陀形象。" ),
                 h5(" 9. 不动如来大乐净土(金刚部所在层面):五色彩虹围绕的蓝色光球内的一个金刚杵。" ),
                 h5(" 10. 观世音布达拉净土:五色彩虹围绕的光球内莲花上的宫殿。" ),
                 h5(" 11. 天界空行净土:一位舞动中的空行母。" ),
                 h5(" 12. 莲花生莲花光净土:莲花中的莲花生大士的三叉戟。" ),
                 h5(" 13. 阿弥陀佛极乐净土(莲花部所在层面):五色彩虹围绕的红色光球内的一朵莲花。" ),
                 h5(" 14. 乌金空行净土:那若卡雀玛的红色对叠三角(生法宫)。" ),
                 h5(" 15. 绿度母净土:五色彩虹围绕的光球内蓝色花中一个绿色的当字母。" ),
                 h5(" 16. 金刚手阿拉瓦提净土:五色彩虹围绕的蓝色光球内一朵花中的蓝色金刚杵。" ),
                 h5(" 17. 香巴拉净土:城市、运河、城墙所围绕的一座山上的官殿，为大山所庇护(香巴拉王国)。" ),
                 h5(" 18. 南却空嘉(天空女王)净土:山上的一座宫殿，在云端之上，五色彩虹围绕的深绿色光球内的苯教女性本尊。" ),
                 h5(" 19. 乐音塔瓦:五色彩虹围绕的光球内一只在奏乐的笛子。”" ),
                 h5(" 20. 云托塔瓦:一个透明的窍轮漂浮在虚空中。" ),
                 h5(" 21. 护持塔瓦:一一个珠宝或宝石，淡绿色，类似于翡翠。" ),
                 h5(" 22. 广遍塔瓦:象朵巨大的盛开莲花，丝绸般闪亮，带有红、白色亮光。" ),
                 h5(" 23. 棍棒塔瓦:一大堆珠宝，或一根棍棒。" ),
                 h5(" 24. 长喜塔瓦:象一个佛塔。" ),
                 h5(" 25. 遍入塔瓦:漩涡形光，- 一种意识层面。" ),
                 h5(" 26. 声音塔瓦:启示花雨之伞。" ),
                 h5(" 27. 五色风塔瓦:风中飘荡的布片。" ),
                 h5(" 28. 珍宝塔瓦:以莲花眼为装饰。" ),
                 h5(" 29. 汇聚塔瓦:一个骑在马背上永远年青的青年。" ),
                 h5(" 30. 白圣塔瓦:一个海螺壳。" ),
                 h5(" 31. 星际塔瓦:一颗放出隆隆声的红色闪电的星星。" ),
                 h5(" 32. 基督教天堂:云中的十字架天使。" ),
                 h5(" 33. 伊斯兰教天堂:云中的新月和星星天使。" ),
                 h5(" 34. 犹太教天堂:云中的六角星天使。" ),
                 h5(" 35. 不动金刚层面(金刚乘的证悟层面之一)：心中的一个金刚杵。" ),
                 h5(" 36. 莲花层面(金刚乘的证悟层面之一):心中一朵莲花。" ),
                 h5(" 37. 遍光层面(金刚乘的证悟层面之一-):一颗发光的心。" ),
                 h5(" 38. 元成持明(四个玛哈瑜伽证悟层面之一): 一朵带轮子和王冠的莲花。" ),
                 h5(" 39. 大手印持明( 四个玛哈瑜伽证悟层面之一):一个安置于轮子和莲花上的坛城，有-“位本尊在其中。" ),
                 h5(" 40. 长寿持明(四个玛哈瑜伽证悟层面之一):一个自在漂浮的众生，带着莲花和轮子，代表着长寿的力量。" ),
                 h5(" 41. 异熟持明(四个玛哈瑜伽证悟层面之一):莲花中显现为本尊的一个瑜伽士。" ),
                 h5(" 42. 十地菩萨(大乘证悟的十个层面之一):云中降下的雨。" ),
                 h5(" 43. 九地菩萨(大乘证悟的十个层面之一):云中闪亮的珠宝。" ),
                 h5(" 44. 八地菩萨(大乘证悟的十个层面之一):发光的三角形，超越二元概念。" ),
                 h5(" 45. 七地菩萨(大乘证悟的十个层面之一):空中高高照耀的太:阳，超越了勤勇的努力。" ),
                 h5(" 46. 六地菩萨(大乘证悟的十个层面之一):彼此相视的脸:轮回和涅粲平等。" ),
                 h5(" 47. 五地菩萨(大乘证悟的十个层面之一-):云层之，上的太阳。" ),
                 h5(" 48. 四地菩萨(大乘证悟的十个层面之一):发光的太阳。" ),
                 h5(" 49. 三地菩萨(大乘证悟的十个层面之一):光亮柔和的太阳。" ),
                 h5(" 50. 二地菩萨(大乘证悟的十个层面之一): 一个禅修中的出家人或在家行者，白色、纯净。" ),
                 h5(" 51. 一地菩萨(大乘证悟的十个层面之一): 一个禅修中的出家人或在家行者，为光所围绕。" ),
                 h5(" 52. 无学道菩萨(大乘五道之一):一个有光环的出家人或在家行者在打坐一证悟四身。" ),
                 h5(" 53. 修道位菩萨( 大乘五道之一):一个静坐的出家人或在家行者，无有畏惧。" ),
                 h5(" 54. 见道位菩萨(大乘五道之一):眼睛一-直接 领悟。" ),
                 h5(" 55. 加行道菩萨(大乘五道之一):修行者心中的火焰一对火焰般的离戏智慧升起强烈道心。" ),
                 h5(" 56. 资粮道菩萨(大乘五道之一-):一个放出并收书得慧的利为众生的出家人。" ),
                 h5(" 57. 缘觉佛成就(小乘的辟支佛):结手印的单修僧人。" ),
                 h5(" 58. 声闻阿罗汉成就(小乘声闻四果):一个说法的僧人。" ),
                 h5(" 59. 声闻不还果(阿那含，小乘声闻三果): 一个站立的僧人，身后是整个世间。" ),
                 h5(" 60. 声闻一还果(斯陀含，小乘声闻二果):一个站在小世界上的僧人。" ),
                 h5(" 61. 声闻入流果(须陀洹，小乘声闻一果):倾听的耳朵。" ),
                 h5(" 62. 声闻寂止道(小乘):一个禅定的僧人。" ),
                 h5(" 63. 阿底瑜伽自解脱道:五色彩虹明点中的白色阿字。" ),
                 h5(" 64. 阿努瑜伽转化道:双运瑜伽士。" ),
                 h5(" 65. 玛哈瑜伽转化道:千秋黑鲁嘎。" ),
                 h5(" 66. 金刚乘直捷道:一位瑜伽士。" ),
                 h5(" 67. 佛法之道:法轮。" ),
                 h5(" 68. 苯教之道:己字。" ),
                 h5(" 69. 印度教之道:字母唵。" ),
                 h5(" 70. 基督教之道:十字架。" ),
                 h5(" 71. 伊斯兰教之道:新月和星星。" ),
                 h5(" 72. 犹太教之道:六角星。" ),
                 h5(" 73. 道教之道:阴阳鱼。" ),
                 h5(" 74. 耆那教之道:耆那教标志。" ),
                 h5(" 75. 神道教之道:礼门，神道教标志。" ),
                 h5(" 76. 萨满教:一只萨满鼓。" ),
                 h5(" 77. 无色界天:旋转的光。" ),
                 h5(" 78. 色界天:一个城堡和彩虹。" ),
                 h5(" 79. 欲界天:一个带花环的王冠。" ),
                 h5(" 80. 半神人(阿修罗):交叉的剑。" ),
                 h5(" 81. 人类:一个婴儿。" ),
                 h5(" 82. 中阴(中间状态):深色背景上的三个明点。" ),
                 h5(" 83. 基督徒中阴:锁链和火。" ),
                 h5(" 84. 伊斯兰教徒中阴:在地下熟睡者，直到天堂或地狱显现。" ),
                 h5(" 85. 阎魔(死主)层面:阎魔的天平，两头放着黑、白色石头。" ),
                 h5(" 86. 大力玛莫:一个跳舞的黑色女性形象。" ),
                 h5(" 87. 楼陀罗:楼陀罗之笼-傲慢。" ),
                 h5(" 88. 濡湿-赞神:红色背景上的武器和旗帜。" ),
                 h5(" 89. 扎提-甲贡:类似多杰列巴的戴帽子的众生，有三只眼。" ),
                 h5(" 90. 夏萨-夜叉:住在地球上的有武器的神灵。" ),
                 h5(" 91. 龙族:蛇形人头，带着王冠。" ),
                 h5(" 92. 年神玛桑:兽头人身。" ),
                 h5(" 93. 爪拉沃玛(武士鬼神):一滴血。" ),
                 h5(" 94. 乾达婆(寻香，天人乐师):神圣乐师的乐器。" ),
                 h5(" 95. 孔班达:兽头海神。" ),
                 h5(" 96. 克拉夫雅达(食肉鬼神):尖牙利齿。" ),
                 h5(" 97. 兰卡罗刹:食人鬼神。" ),
                 h5(" 98. 布塔鬼:令天人、阿修罗颤抖的恐怖鬼神。" ),
                 h5(" 99. 毗舍遮鬼:八部鬼神的不同形象。" ),
                 h5(" 100. 传播疾病的乌帕扎瓦魔:一小袋疾病。" ),
                 h5(" 101. 维格纳魔(障碍者):魔鬼的脸。" ),
                 h5(" 102. 畜生道:一只小鸡叨着虫子。" ),
                 h5(" 103. 饿鬼道:总是处于饥饿中，肚子大，脖子细，灰色。" ),
                 h5(" 104. 地狱道:深褐色背景中的魔鬼的脸。" ),
                 h5(" 105. 金刚地狱:大火中的十字金刚杵。" ),
                 h5(" 106. 基督教地狱:大火中的大叉子。" ),
                 h5(" 107. 伊斯兰教地狱:大火中的压人的石头。" ),
                 h5(" 108. 多欲黑地狱:黑色中心的黑色地狱。" )
                 
        ),
        tabPanel("游戏规则", 
                 h5(" 游戏规则" , align = 'center'),
                 tags$hr(),
                 h5(" 1.游戏者数量: 2到10人。" ),
                 h5(" 2.大致游戏时间:45分钟到1小时，取决于游戏者的数量。年龄: 6岁以上。" ),
                 h5(" 3.此游戏需要有解脱游戏棋盘，本游戏指令书，棋子，两个骰子，每人一-枚棋子。" ),
                 h5(" 4.每个游戏者都从人类层面(数字81)开始。根据抛掷两个骰子的结果来走棋，。两个骰子从小到大排列结果(如:一个骰子为1,另一个为3,结果即为1 3),按照骰子排列结果来走棋。每对数字指示着一个括弧 中的标有数字的层面，这就是棋子移动的地方。" ),
                 h5(" 5.此游戏可以任何人开始，顺时针移动。" ),
                 h5(" 6.游戏直到所有人进入法身层面才结束，法身是棋盘中央的主要区域。" ),
                 h5(" 7.根据骰子抛掷的结果，游戏者要么停留原地不动，要么去到另一个层面， 要么根据相关标志的特别指令移动。" ),
                 h5(" 8.此游戏可用通常的数字设子，或标有“啊阿哈夏萨玛”的特制骰子来玩，这六个字母分别相应1,2,3, 4,5,6." )
                 
        ),
        tabPanel("游戏标志的含义", 
                 h5(" 游戏标志的含义", align = 'center'),
                 tags$hr(),
                 h5(" *  当你获得这个标志，这指示着你移动的方向，你可以自由地往下走。(译注:此标志只是意味着你下一-步会去较高等的层面)" ),
                 h5(" +  当你按照指示要去另一个层面，你就去。如果你立刻掷出一对相同数字，如“啊啊”(11)，一直到“玛玛”(66)，你可以自由地往下走;如果你没有立刻掷出一对相同数字，你应该回到你刚才所在的地方。" ),
                 h5(" &  你来自一个纯净或高等的层面，在轮回中利益众生，直到你掷出一对相同数字如“啊啊”(11)，一直到“玛玛”(66),得到一对相同数字时，你应该立刻回到你刚才所在的地方。" ),
        ),
        tabPanel("索引",
                 sidebarLayout(
                     sidebarPanel(
                         numericInput("NowPlace", '您所在的位置', value = 81,
                                      max = 108, min = 1, step = 1), 
                         tags$hr(),
                         selectInput("Number", "骰子:",
                                     choices = c(11,22,33,44,55,66,
                                                 12,13,14,15,16,
                                                 23,24,25,26,
                                                 34,35,36,
                                                 45,46,
                                                 56),
                                     selected = 11)
                         
                     ),
                     mainPanel(
                         verbatimTextOutput("NextPlace"),
                         tags$hr(),
                         #DT::dataTableOutput("table")
                         tableOutput("Table2")
                     )
                 )
                 
        )
    )
)

server <- function(input, output) {
    dat <- reactive({
      NowPlace = input$NowPlace
      IndexsforNow = IndexTables[[NowPlace-1]]
      LabelsforNow = LabelTables[[NowPlace-1]]
      NextPlacesAll = rep('', 21)
      for (i in 1:21) {
        NextPlacesAll[i] = Table_places[Table_places[,1] == IndexsforNow[i], 2]
      }
      df = data.frame(1:21, as.character(Number_touzi), 
                      as.character(IndexsforNow), 
                      NextPlacesAll, LabelsforNow 
                      )
      colnames(df) = c('序号', '骰子', '去处', '去处解释', '标记')
      df
    })

    # output$table <- DT::renderDataTable(
    #     #----预览订单数据库 或者 客户信息数据库
    #     {
    #         DT::datatable(
    #           dat(),
    #             options = list(length = 15)
    #         )
    #     }
    # )
    output$Table2 <- renderTable(
      dat()
    )
    output$NextPlace <- renderText(
      {
        dat = dat()
        Touzi = input$Number
        Nextplace_ID = dat[dat[,2] == Touzi,'去处']
        Nextplace_place = dat[dat[,2] == Touzi,'去处解释']
        Nextplace_label = dat[dat[,2] == Touzi,'标记']
        if ( Nextplace_ID == input$NowPlace) {
          #print(paste0('停留\n','前往-->', Nextplace_ID, '：',Nextplace_place, " ",  Nextplace_label))
          out = paste0('停留\n','前往-->', Nextplace_ID, '：',Nextplace_place, " ",  Nextplace_label)
          out
        } else {
          #print(paste0('前往-->', Nextplace_ID, '：',Nextplace_place, " ",  Nextplace_label))
          out = paste0('前往-->', Nextplace_ID, '：',Nextplace_place, " ",  Nextplace_label)
          out
        }
        
        
      })
    
}



shinyApp(ui, server)
